# -*- mode:org; mode: flyspell; -*-

#+SETUPFILE: ../include/practice.h.org

#+TITLE: Discrete mathematics I. practice - Number theory
#+SHORT_TITLE: Number theory

* Solutions
  
  Divisibility: we say that $a$ divides $b$ ($a,b \in \mathbb{Z}$) if
  $\exists k \in \mathbb{Z}$ so that $ak=b$ and we write $a \mid b$
  (if $a$ doesn't divide $b$ then we write $a \nmid b$).

  1. Let $N=n(n + 1)(2n + 1)$, and to show that $6 \mid N$ we have to
     show that $2 \mid N$ and $3 \mid N$.  If $n$ is even, then $2
     \mid N$, if $n$ is odd, then $2 \mid n+1$, so $2 \mid N$.  If $3
     \mid n$, we are done, if not, then $n = 3k+1$ or $n = 3k+2$ (for
     some integer $k$).  If $n = 3k + 2$ then $n + 1 = 3k + 2 + 1 =
     3k + 3$ which is divisible by 3, and if $n = 3k + 1$ then $2n + 1
     = 2(3k+1) +1 = 6k + 2 + 1 = 6k + 3$ which is also divisible
     by 3. So $N$ is divisible by 2 and 3 so it is divisible by 6.

  2. $M=m^5-m$. To prove that $30 \mid M$ we need to show that $2 \mid
     M$, $3 \mid M$ and $5 \mid M$. 

     $M= m (m^4 - 1) = m (m^2 -1 ) (m^2 + 1) = m (m-1)(m+1) (m^2 +
     1)$.  So it is trivial that $2 \mid M$ and $3 \mid M$ because,
     $m-1$, $m$ and $m+1$ are three consecutive numbers, \ie at least
     one of them has to be divisible by 2 and at least one by 3.
     
     #+BEGIN_SRC C
       int i;
       int n = 5;
       for(i=0; i<n; i++)
         printf("%d mod %d = %d\n", i, 3, i%3);
     #+END_SRC

     #+RESULTS:
     | 0 | mod | 3 | = | 0 |
     | 1 | mod | 3 | = | 1 |
     | 2 | mod | 3 | = | 2 |
     | 3 | mod | 3 | = | 0 |
     | 4 | mod | 3 | = | 1 |

     But how to show that $5 \mid M$? So $m=5k$ or $m=5k \pm 1$ or
     $m=5k\pm2$ ($k\in\mathbb{Z}$).  So if $m=5k$ then $5 \mid M$, if
     $m=5k+1$ then $5 \mid m-1 \mid M$, if $m=5k-1$ then $5 \mid m+1
     \mid M$, if $m = 5k \pm 2$ then $m^2 = 25k^2 \pm 20 k + 4$, so
     $m^2 + 1 = 25k^2 \pm 20 k + 4 +1$ which is divisible by 5. So we
     are done, bye bye!

  3. 

  4. 

  5. 

  6. 

  7. 

  8. 

  9. 

  10. 

  11. 

  12. 

  13. 

  14. 

  15. 

  16. 

  17. 

  18. 

  19. 

  20. 

  21. 

  22. The last three digits are $x = 3^{1203} \bmod 1000$, which is a
      solution of $x\equiv 3^{1203} \pmod{1000}$.  We can calculate,
      that $\varphi(1000)=400$ and by the Euler-Fermat theorem
      $3^{400} \equiv 1 \pmod{1000}$, so $x \equiv 3^{1203} =
      3^{400\cdot 3 + 3} = (3^{400})^{3}\cdot 3^3 \equiv 1^3\cdot 3^3
      = 27 \pmod{1000}$.  So the last three digits of the mentioned
      numbere are 027.

  23. $17$ is prime so, $\varphi(17)=16$.  $163 \bmod 16 = 3$, so $x
      \equiv 173^{163} \equiv 3^{163} = 3^{q\cdot16+3} =
      (3^{16})^{q}\cdot 3^3 \equiv 1^q \cdot 3^{3} =27 \pmod{17}$.

  24. 

  25. $103$ is prime, so $\varphi(103)=102$.  So we calculate $x
      \equiv 205^{206^{207}} \equiv (-1)^{206^{207}} = (-1)^{q \cdot
      102 + r} = ((-1)^{102})^{q} \cdot (-1)^r = (-1)^{r} \pmod{103}$
      where $r \equiv 206^{207} \pmod{102}$. $r$ cannot be odd, so $r$
      is even, which means that $x\equiv 1 \pmod{103}$.

      #+BEGIN_SRC python :exports none
        return 2012%16 
      #+END_SRC

      #+RESULTS:
      : 12
